Tekla Open API Reference for Tekla Structures 2025
CannotPerformOperationNumberingNotUpToDate Class
 The CannotPerformOperationNumberingNotUpToDate class defines the exception that is thrown when a user tries to do an operation which requires that numbering is up to date.
Inheritance Hierarchy
System.Object
 System.Exception
 System.ApplicationException
 Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException
 Tekla.Structures.Drawing.CannotPerformOperationNumberingNotUpToDate
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class CannotPerformOperationNumberingNotUpToDate : TeklaStructuresDrawingsApplicationException
<SerializableAttribute>
Public Class CannotPerformOperationNumberingNotUpToDate
	Inherits TeklaStructuresDrawingsApplicationException
The CannotPerformOperationNumberingNotUpToDate type exposes the following members.
Constructors
Name | Description
CannotPerformOperationNumberingNotUpToDate
 Creates a new cannot perform operation numbering not up to date exception instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace